{
  "sheets": [
    {
      "name": "P90X",
      "description": "P90X, or Power 90 Extreme, is a commercial home exercise regimen created by Tony Horton. Developed as a successor to the program called \"Power 90\", it is designed to take 90 days, and consists of a training program that uses cross-training and periodization, combined with a nutrition and dietary supplement plan.",
      "length": "3 month",
      "avgWorkoutTime": "1 hour",
      "difficulty": "extreme"
    },
    {
      "name": "P90X2",
      "description": "P90X revolutionized fitness. Now, P90X2 will change the way you work out…forever. P90X2 delivers the kind of results pro athletes insist on. Not by making you work harder…but by helping you work smarter.",
      "length": "3 month",
      "avgWorkoutTime": "1 hour",
      "difficulty": "extreme"
    },
    {
      "name": "P90X3",
      "description": "It's not a sequel to P90X (or anything else). It's an all-new program of super-efficient workouts, each one packed with 30 minutes of concentrated intensity.",
      "length": "3 month",
      "avgWorkoutTime": "30 minute",
      "difficulty": "extreme"
    },
    {
      "name": "P90X+",
      "description": "If you love P90X® and you're looking to increase the intensity or need new routines to keep things fresh, here's your answer—the P90X Plus Series.",
      "length": "3 month",
      "avgWorkoutTime": "1 hour",
      "difficulty": "extreme"
    },
    {
      "name": "10 Minute Trainer",
      "description": "“Can you really get a good workout in 10 minutes? Absolutely. Don’t get me wrong…you’ll have to work hard. But you don't need to spend an hour working out. You can get it all done in way less time. And get on with your day.",
      "length": "3 month",
      "avgWorkoutTime": "10 minute",
      "difficulty": "easy"
    },
    {
      "name": "P90",
      "description": "Extreme programs like P90X aren't for everyone. So welcome to P90—your gateway to getting fit regardless of your age or fitness level! Legendary trainer Tony Horton has now created shorter workouts that are simple, doable, and less extreme than his others, but still just as effective.",
      "length": "3 month",
      "avgWorkoutTime": "25 minute",
      "difficulty": "normal"
    }
  ,
    {
      "name": "22 Minute Hard Corps",
      "description": "If you \"Fall In\" for 22 minutes a day for just 8 weeks, and follow this basic-training program, you will see outstanding results!",
      "length": "2 month",
      "avgWorkoutTime": "22 minute",
      "difficulty": "hard"
    }
  ]
}